
## Plan Result

[CI link](https://github.com/ikigaikintore/ikigaikintore/actions/runs/7669648503)


<pre><code>Plan: 3 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * google_project_iam_member.backend-sa-roles[&#34;roles/iam.serviceAccountTokenCreator&#34;]
  * google_project_iam_member.backend-sa-roles[&#34;roles/iam.serviceAccountUser&#34;]
  * google_service_account.backend-sa
* Update
  * google_artifact_registry_repository.artifact-repository


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_artifact_registry_repository.artifact-repository will be updated in-place
  ~ resource "google_artifact_registry_repository" "artifact-repository" {
        id               = "projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai"
        name             = "ikigai"
        # (10 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

  # google_project_iam_member.backend-sa-roles["roles/iam.serviceAccountTokenCreator"] will be created
  + resource "google_project_iam_member" "backend-sa-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "gig-japan-398904"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # google_project_iam_member.backend-sa-roles["roles/iam.serviceAccountUser"] will be created
  + resource "google_project_iam_member" "backend-sa-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "gig-japan-398904"
      + role    = "roles/iam.serviceAccountUser"
    }

  # google_service_account.backend-sa will be created
  + resource "google_service_account" "backend-sa" {
      + account_id   = "backend-sa"
      + disabled     = false
      + display_name = "backend"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "gig-japan-398904"
      + unique_id    = (known after apply)
    }

Plan: 3 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"summary_plan","PRNumber":22,"Program":"tfcmt","SHA1":"67d6ea05b2cb9ab32558e27175a9ff4a021c0e6a","Vars":{},"WorkflowName":"iaac_plan"} -->